attacker145/NRF51822/main.c
/* Copyright (c) 2014 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is property of Nordic Semiconductor ASA.
 * Terms and conditions of usage are described in detail in NORDIC
 * SEMICONDUCTOR STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 * Licensees are granted free, non-transferable use of the information. NO
 * WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 * the file.
 *
 */

/** @file
 *
 * @defgroup ble_sdk_uart_over_ble_main main.c
 * @{
 * @ingroup  ble_sdk_app_nus_eval
 * @brief    UART over BLE application main file.
 *
 * This file contains the source code for a sample application that uses the Nordic UART service.
 * This application uses the @ref srvlib_conn_params module.
 * Additional files:
   1. nrf_drv_spi.c 
 */

#include <stdint.h>
#include <string.h>
#include "nordic_common.h"
#include "nrf.h"
#include "ble_hci.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "softdevice_handler.h"
#include "app_timer.h"
#include "app_button.h"
#include "ble_nus.h"
#include "app_uart.h"
#include "app_util_platform.h"
#include "bsp.h"
#include "bsp_btn_ble.h"


//SPI LIBRARIES
#include "nrf_drv_spi.h"
#include "app_util_platform.h"
#include "nrf_gpio.h"
#include "nrf_delay.h"
#include "nrf_log.h"
#include "boards.h"
#include "app_error.h"


// SPI SPI SPI SPI
#if defined(BOARD_PCA10036) || defined(BOARD_PCA10040)
#define SPI_CS_PIN   29 /**< SPI CS Pin.*/
#elif defined(BOARD_PCA10028)
//#define SPI_CS_PIN   4  /**< SPI CS Pin.*/
#define SPI_CS_PIN   19  /**< SPI CS Pin.*/			//04/27/2016
#else
#error "Example is not supported on that board."
#endif

#define SPI_INSTANCE  0 /**< SPI instance index. */
static const nrf_drv_spi_t spi = NRF_DRV_SPI_INSTANCE(SPI_INSTANCE);  /**< SPI instance. */
static volatile bool spi_xfer_done;  /**< Flag used to indicate that SPI instance completed the transfer. */

#define TEST_STRING "Nordic"
//static uint8_t       m_tx_buf[] = TEST_STRING;           /**< TX buffer. 6 bytes*/
//static uint8_t       m_rx_buf[sizeof(TEST_STRING)+1];    /**< RX buffer. 7 bytes*/

//static uint8_t       m_tx_buf[7] = TEST_STRING; /**< TX buffer. 7 bytes*/
static uint8_t       m_rx_buf[7];    						/**< RX buffer. 7 bytes*/


//static const uint8_t m_length = sizeof(m_tx_buf);        /**< Transfer length. */
//SPI configuration and data buffers for ADS1247 ADC
/*******************************************************************
	* SPI Commands: Thermo Couple Config
	*******************************************************************
	* {0x40,0x03,0x01,0x02,0x40,0x71}
		n = number of registers to be read or written (number of bytes – 1)
		r = register (0 to 15)
		x = don't care
		
		Write to register rrrr number of registers nnnn [0100 rrrr (4xh)]	/ 0000_nnnn	
		0x40 0x03 - Write starting with  reg 00h to 03h (4 registers total)
				
	* Write 0x01 to  Register 00h:                         0x01
			00 = Burnout current source off (default)
			Positive input channel selection bits:
			000 = AIN0 (default)
			Negative input channel selection bits:
			001 = AIN1 (default)

	* VBIAS—Bias Voltage Register 1:                       0x02
			Bias voltage is applied on VBIAS1

	* MUX1—Multiplexer Control Register 2:                 0x40
		0 = Internal oscillator in use
		10 or 11 = Internal reference is on when a conversion is in progress and shuts down when the device receives a shutdown opcode or the START pin is taken low
		00 = REF0 input pair selected (default)
		000 = Normal operation (default)

	* SYS0—System Control Register 3:                      0x71
		Bit 7 This bit must always be set to '0'
		PGA2:0 These bits determine the gain of the PGA: 111 = 128
		DOR3:0 These bits select the output data rate of the ADC. Bits with a value higher than 1001 select the highest data rate of 2000SPS
		0001 = 10SPS

	* 1. Turn off the burnout current source
	* 2. Select AIN0 as a positive input
	* 3. Select AIN1 as a negative input
	* 4. Bias voltage is applied on VBIAS1
	* 5. Use internal oscillator
	* 6. Enable internal reference
	* 7. Use REF0 input pair
	* 8. Select normal operation 
	* 9. Set gain of 128
	* 10. Set 10 samples per second
	*/
static uint8_t adc_setup_TC[]			= {0x40,0x03,0x01,0x02,0x40,0x71}; 	//ADC TC config with VBIAS{0x40,0x03,0x01,0x02,0x40,0x70}, w/o VBIAS {0x40,0x03,0x01,0x00,0x40,0x70} 
//static uint8_t adc_setup_TC[]			= {0x40,0x03,0x00,0x01,0x02,0x03};
//static uint8_t adc_wr_setup[]			= {0,0,0,0,0,0};     								//ADC setup NULL array
static uint8_t adc_data[]					= {0,0,0,0,0,0};     								//ADC conv NULL array for 3 bytes each RTD and TC values 
//static uint8_t adc_data[]					= {0,0,0};
static uint8_t read_data_cont [] = {0x14};

static const uint8_t m_length_setup_tc 					= sizeof(adc_setup_TC);        	/**< Transfer length. */
//static const uint8_t m_length_setup 					= sizeof(adc_wr_setup);        	/**< Transfer length. */
static const uint8_t m_length_conv 							= sizeof(adc_data);        			/**< Transfer length. */
static const uint8_t length_read_data_cont 			= sizeof(read_data_cont);        			/**< Transfer length. */
uint8_t Rx_bufc[3];
uint8_t Rx_buf[10];
uint8_t tensc;
uint8_t onesc;
uint8_t hundredsc;
static uint8_t *spibuff;

/*
 * Convert uint32_t hex value to an uint8_t array.
 */
void hexdec_long( uint32_t count )
{	
    uint8_t ones;
    uint8_t tens;
    uint8_t hundreds;
    uint8_t thousands;
    uint8_t thousand10s;
    uint8_t thousand100s;
    uint8_t mill;
    uint8_t mill10s;
    uint8_t mill100s;
    uint8_t bills;
    
		bills						= 0;
		mill100s				= 0;
		mill10s					= 0;			
		mill						= 0;
		thousand100s 		= 0;
		thousand10s 		= 0;
		thousands 			= 0;
		hundreds 				= 0;
		tens  					= 0;						
		ones 						= 0;

		while ( count >= 1000000000 )
		{
			count -= 1000000000;				// subtract 1000000000, one billion		
			bills++;										// increment billions
		}
		while ( count >= 100000000 )
		{
			count -= 100000000;					// subtract 100000000, 100 million		
			mill100s++;									// increment 100th millions
		}
		while ( count >= 10000000 )
		{
			count -= 10000000;					// subtract 10000000		
			mill10s++;									// increment 10th millions
		}
		while ( count >= 1000000 )
		{
			count -= 1000000;						// subtract 1000000	
			mill++;											// increment 1 millions
		}	
		while ( count >= 100000 )
		{
			count -= 100000;						// subtract 100000		
			thousand100s++;							// increment 100th thousands
		}	
		while ( count >= 10000 )
		{
			count -= 10000;             // subtract 10000
			thousand10s++;							// increment 10th thousands
		}
		while ( count >= 1000 )
		{
			count -= 1000;							// subtract 1000	
			thousands++;								// increment thousands
		}
		while ( count >= 100 )
		{
			count -= 100;               // subtract 100	
			hundreds++;                 // increment hundreds
		}
		while ( count >= 10 )
		{
			count -= 10;								// subtract 10		
			tens++;											// increment tens
		}
			ones = count;								// remaining count equals ones
				
			Rx_buf[0]= bills + 0x30;    //Conver HEX to character
			Rx_buf[1]= mill100s + 0x30;
      Rx_buf[2]= mill10s + 0x30;
      Rx_buf[3]= mill + 0x30;
      Rx_buf[4]= thousand100s + 0x30;
      Rx_buf[5]= thousand10s + 0x30;
      Rx_buf[6]= thousands + 0x30;
      Rx_buf[7]= hundreds + 0x30;
      Rx_buf[8]= tens   + 0x30;
      Rx_buf[9]= ones + 0x30;
}
/*
 * Convert uint8_t hex value to an uint8_t array.
 */
void hexdec_char( uint8_t countc )
{	
	hundredsc = 0;
	tensc  		= 0;						
	onesc 		= 0;
	while ( countc >= 100 )
	{
		countc -= 100;	// subtract 100
		hundredsc++;		// increment hundreds
	}

	while ( countc >= 10 )
	{
		countc -= 10;		// subtract 10
		tensc++;				// increment tens
	}

