attacker145/NRF51822/main.c
/**@brief  Function for initializing the UART module.
 */
/**@snippet [UART Initialization] */
static void uart_init(void)
{
    uint32_t                     err_code;
    const app_uart_comm_params_t comm_params =
    {
        RX_PIN_NUMBER,
        TX_PIN_NUMBER,
        RTS_PIN_NUMBER,
        CTS_PIN_NUMBER,
        //APP_UART_FLOW_CONTROL_ENABLED,
			  APP_UART_FLOW_CONTROL_DISABLED,
        false,
        //UART_BAUDRATE_BAUDRATE_Baud115200
				UART_BAUDRATE_BAUDRATE_Baud9600
    };

    APP_UART_FIFO_INIT( &comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_event_handle,
                       APP_IRQ_PRIORITY_LOW,
                       err_code);
    APP_ERROR_CHECK(err_code);
}
/**@snippet [UART Initialization] */


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    uint32_t      err_code;
    ble_advdata_t advdata;
    ble_advdata_t scanrsp;

    // Build advertising data struct to pass into @ref ble_advertising_init.
    memset(&advdata, 0, sizeof(advdata));
    advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    advdata.include_appearance = false;
    advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

    memset(&scanrsp, 0, sizeof(scanrsp));
    scanrsp.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    scanrsp.uuids_complete.p_uuids  = m_adv_uuids;

    ble_adv_modes_config_t options = {0};
    options.ble_adv_fast_enabled  = BLE_ADV_FAST_ENABLED;
    options.ble_adv_fast_interval = APP_ADV_INTERVAL;
    options.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;

    err_code = ble_advertising_init(&advdata, &scanrsp, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS,
                                 APP_TIMER_TICKS(100, APP_TIMER_PRESCALER), 
                                 bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for placing the application in low power state while waiting for events.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}


/**@brief Application main function.
 */
//unsigned char *uart;

int main(void)
{
    uint32_t err_code;
    bool erase_bonds;
 				
		nrf_gpio_cfg_output(21);
		nrf_gpio_pin_set(21);
		nrf_gpio_cfg_output(22);
		nrf_gpio_pin_set(22);
		nrf_gpio_cfg_input(23, NRF_GPIO_PIN_NOPULL );
	
    // Initialize.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
    uart_init();
    
    buttons_leds_init(&erase_bonds);
    ble_stack_init();
    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();
		//SPI-------------------------------------------------------------------------------
	  /*
	   *nrf_drv_config.h
	   *#define SPI0_CONFIG_SCK_PIN         16
	   *#define SPI0_CONFIG_MOSI_PIN        17
     *#define SPI0_CONFIG_MISO_PIN        18
		*/
		nrf_drv_spi_config_t spi_config = NRF_DRV_SPI_DEFAULT_CONFIG(SPI_INSTANCE);	// Configure SPI nrf_drv_spi.h line 151
    spi_config.ss_pin = SPI_CS_PIN;				//CS is pin 19
    APP_ERROR_CHECK(nrf_drv_spi_init(&spi, &spi_config, spi_event_handler));
		//----------------------------------------------------------------------------------
    printf("\r\nUART Start!\r\n");				 
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
    
		
		
		
		//while(1){
		spibuff = adc_setup_TC;	//static uint8_t adc_setup_TC[]			= {0x40,0x03,0x01,0x02,0x40,0x71};			
		// Reset rx buffer and transfer done flag
    memset(m_rx_buf, 0, m_length_setup_tc);
    spi_xfer_done = false;				
		//APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, (uint8_t const *)spibuff, m_length_setup_tc, m_rx_buf, m_length_setup_tc));
		APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, adc_setup_TC, m_length_setup_tc, m_rx_buf, m_length_setup_tc));
		while (!spi_xfer_done)
    {
			__WFE();
    }
		
		hexdec_char( (uint8_t) adc_setup_TC[0] );				// Fills up Rx_bufc		
		NRF_LOG_PRINTF("SPI TC config: %s\r\n", Rx_bufc);	
		hexdec_char( (uint8_t) adc_setup_TC[1] );				// Fills up Rx_bufc
		NRF_LOG_PRINTF("SPI TC config: %s\r\n", Rx_bufc);
		hexdec_char( (uint8_t) adc_setup_TC[2] );				// Fills up Rx_bufc
		NRF_LOG_PRINTF("SPI TC config: %s\r\n", Rx_bufc);
		hexdec_char( (uint8_t) adc_setup_TC[3] );				// Fills up Rx_bufc		
		NRF_LOG_PRINTF("SPI TC config: %s\r\n", Rx_bufc);	
		hexdec_char( (uint8_t) adc_setup_TC[4] );				// Fills up Rx_bufc
		NRF_LOG_PRINTF("SPI TC config: %s\r\n", Rx_bufc);
		hexdec_char( (uint8_t) adc_setup_TC[5] );				// Fills up Rx_bufc
		NRF_LOG_PRINTF("SPI TC config: %s\r\n", Rx_bufc);
		
		nrf_delay_ms(1);
	//}
		
		
		spibuff = read_data_cont;				
		// Reset rx buffer and transfer done flag
    memset(m_rx_buf, 0, length_read_data_cont);
    spi_xfer_done = false;				
		APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, (uint8_t const *)spibuff, length_read_data_cont, m_rx_buf, length_read_data_cont));
		while (!spi_xfer_done)
    {
			__WFE();
    }
		
		nrf_delay_ms(1);
		
		
		
    // The main loop.
    for (;;)
    {
			//-- SPI---
				while(nrf_gpio_pin_read (23)){
					power_manage();
				}//!DRDY	
				
				spibuff = adc_data;
				// Reset rx buffer and transfer done flag
				memset(m_rx_buf, 0, m_length_conv);
				spi_xfer_done = false;				
				//APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, m_tx_buf, m_length, m_rx_buf, m_length)); // Sends: #define TEST_STRING "Nordic"
				APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, (uint8_t const *)spibuff, m_length_conv, m_rx_buf, m_length_conv));
				while (!spi_xfer_done)
				{
            __WFE();
				}
					//ble_nus_string_send(&m_nus, m_rx_buf, 6);  //Rx_buf
				ble_nus_string_send(&m_nus, Rx_buf, 10);
				LEDS_INVERT(BSP_LED_0_MASK);
				nrf_delay_ms(500);
			}					           
}


/** 
 * @}
 */
